app/Http/Controllers/Api/ProductsController.php

select * from `products` where `provider_id` = '1'
---
    public function providers($id)
    {
        // http://127.0.0.1:8000/api/products/provider/1

        $productResult = Product::where('provider_id', '=', $id)->get();