app/Http/Controllers/client/ProductController.php

    public function show(Product $product)
    {
        $images = ImagesProduct::where('imagesproducts.product_id', '=', $product->id)->get();
---
select * from `imagesProducts` where `imagesproducts`.`product_id` = 2

    public function index()
    {
        $products = Product::all();
        $categories = Category::all();
        $inventories = Inventory::all();
---
select * from `products`
select * from `categories`
select * from `inventories`

    public function category($category)
    {
        // dd($category);
        $products = Product::where('category_id', '=', $category)->get();
        $categoryQuery = Category::find($category);
        $categories = Category::all();
---
select * from `products` where `category_id` = '4'
select * from `categories`