app/Http/Controllers/admin/BuyController.php

select * from `buys` order by `updated_at` desc limit 15 offset 0
select count(*) as aggregate from `buys`
---
    public function index()
    {
        return view('admin.buy.index', [
          'buys' =>Buy::orderBy('updated_at', 'desc')->paginate()
        ]);

select * from `administrators` where `user_id` = '1'
---
    public function store(Request $request)
    {
        // dd($request);
        $admin = Administrator::where('user_id', '=', $request->user_id)->get();

select * from `buydetails` where `buy_id` = 3
---
    public function show(Buy $buy)
    {
        $details = BuyDetail::where('buy_id', '=', $buy->id)->get();

update `buys` set `status_id` = '3', `buys`.`updated_at` = '2020-08-02 18:41:40' where `id` = 3
---
        }

        if ($buy->status_id == 1 && $request->status_id == 3) {
            $buy->update($request->all());