app/Http/Controllers/admin/CategoryController.php

select * from `categories` order by `updated_at` desc limit 15 offset 0
select count(*) as aggregate from `categories`
---
    public function index()
    {
        return view('admin.category.index', [
            'categories' => Category::orderBy('updated_at', 'desc')->paginate()
        ]);