app/Http/Controllers/admin/ImagesProductController.php

update `imagesProducts` set `url` = 'products/quv78eOlsN9s4E3ce4Hucm9WpLCmyntlDUAdHVwu.jpeg', `product_id` = 1, `imagesProducts`.`updated_at` = '2020-08-02 18:36:13' where `id` = 15
---
    public function store(ImageRequest $request, Product $product)
    {//salvar
        $image = ImagesProduct::create($request->all());
        $image->product_id = $product->id;
        //imagen
        $image->url = $request->url->store('products', 'public');
        $image->save();