app/Http/Controllers/admin/ProductsController.php

select * from `products` order by `id` asc limit 15 offset 0
select count(*) as aggregate from `products`
---
    public function index()
    {
        return view('admin.product.index', [
          'products' =>Product::orderBy('id', 'asc')->paginate()
        ]);

select * from `imagesProducts` where `imagesproducts`.`product_id` = 1
---
    public function show(Product $product)
    {
        // dd($product);
        $images = ImagesProduct::where('imagesproducts.product_id', '=', $product->id)->get();

update `products` set `statusProduct_id` = '1', `provider_id` = '3', `products`.`updated_at` = '2020-08-02 18:36:40' where `id` = 1
---
    public function update(ProductRequest $request, Product $product)
    {
        if ($request->costo_prod > $request->precio_prod) {
            return back()->with('status', 'No puedes vender a perdida.');
        } else {
            $product->update($request->all());

select * from `imagesProducts` where `imagesproducts`.`product_id` = 1
---
    public function images(Product $product)
    {
        $images = ImagesProduct::where('imagesproducts.product_id', '=', $product->id)->get();