app/Http/Controllers/admin/ProviderController.php

select * from `providers` order by `updated_at` desc limit 15 offset 0
select count(*) as aggregate from `providers`
---
    public function index()
    {
        return view('admin.provider.index', [
            'providers' => Provider::orderBy('updated_at', 'desc')->paginate()
        ]);