app/Http/Controllers/admin/UsersController.php

    public function index()
    {
        return view('admin.user.index', [
            'users' => User::orderBy('updated_at', 'desc')->paginate()
        ]);
---
select * from `users` order by `updated_at` desc limit 15 offset 0
select count(*) as aggregate from `users`

    public function show(User $user)
    {
        $addresses = Address::where('addresses.user_id', '=', $user->id)->get();
---
select * from `addresses` where `addresses`.`user_id` = 6

    public function delete(Request $request, User $user)
    {
        $user->update($request->all());
---
update `users` set `typeUser_id` = '4', `users`.`updated_at` = '2020-08-02 18:32:17' where `id` = 6